{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"dense_166_input": {"name": "dense_166_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"dense_171": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_7/dense_166/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_166/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_167/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_167/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_168/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_168/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_169/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_169/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_170/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_170/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_171/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_171/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "dense_166_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_166/BiasAdd", "op": "_FusedMatMul", "input": ["dense_166_input", "StatefulPartitionedCall/sequential_7/dense_166/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_166/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_167/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_166/BiasAdd", "StatefulPartitionedCall/sequential_7/dense_167/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_167/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_167/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_7/dense_167/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_168/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_167/Sigmoid", "StatefulPartitionedCall/sequential_7/dense_168/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_168/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_168/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_7/dense_168/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_169/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_168/Sigmoid", "StatefulPartitionedCall/sequential_7/dense_169/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_169/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_169/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_7/dense_169/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_170/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_169/Sigmoid", "StatefulPartitionedCall/sequential_7/dense_170/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_170/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_170/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_7/dense_170/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_171/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_170/Sigmoid", "StatefulPartitionedCall/sequential_7/dense_171/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_171/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_7/dense_171/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_7/dense_166/MatMul/ReadVariableOp", "shape": [3, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_166/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_167/MatMul/ReadVariableOp", "shape": [3, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_167/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_168/MatMul/ReadVariableOp", "shape": [8, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_168/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_169/MatMul/ReadVariableOp", "shape": [8, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_169/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_170/MatMul/ReadVariableOp", "shape": [8, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_170/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_171/MatMul/ReadVariableOp", "shape": [8, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_171/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}